# -*- coding: utf-8 -*-
from constant import *

class Strategy_Var():
    '''
    info = {
        "GC" : {
            파라 : {
                "차트": [
                    [틱차트, "60"],
                    [틱차트, "120"]
                ],
                "차트변수": {
                    틱차트: {
                        "60": {
                            "이동평균선": [45, 160],
                            "INIT_AF": 0.0008,
                            "MAX_AF": 0.002,
                            "초기캔들수": 3000
                        },
                        "120": {
                            "이동평균선": [45, 160],
                            "INIT_AF": 0.0008,
                            "MAX_AF": 0.002,
                            "초기캔들수": 1500
                        }
                    },
                    분차트: {
                    },
                    매매불가수익량: 50,
                    청산단계별드리블틱: [0, 5, 15]
                }
            },
            "남한산성" : {

            }
        }
    }
    '''
    info = None
    def __init__(self):
        self.info = {}