# -*- coding: utf-8 -*-

info = {
    "GC" : {
        "파라" : {
            "차트": [
                ["틱차트", "60"]
            ],
            "차트변수": {
                "틱차트": {
                    "60": {
                        "이동평균선": [45, 160],
                        "INIT_AF": 0.0008,
                        "MAX_AF": 0.002,
                        "초기캔들수": 3000
                    }
                },
                "분차트": {
                }
            }
        },
        "남한산성" : {

        }
    }
}